In [90]:
import pandas as pd
import matplotlib.pyplot as plt

In [9]:
# Load Data Scientist Jobs Dataset https://www.kaggle.com/datasets/andrewmvd/data-scientist-jobs

In [10]:
df_data_scientist = pd.read_csv('DataScientist.csv', index_col='index')

In [11]:
df_data_scientist

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,Easy Apply
index,,,,,,,,,,,,,,,
0,Senior Data Scientist,$111K-$181K (Glassdoor est.),"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...",3.5,Hopper\n3.5,"New York, NY","Montreal, Canada",501 to 1000 employees,2007,Company - Private,Travel Agencies,Travel & Tourism,Unknown / Non-Applicable,-1,-1
1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),"At Noom, we use scientifically proven methods ...",4.5,Noom US\n4.5,"New York, NY","New York, NY",1001 to 5000 employees,2008,Company - Private,"Health, Beauty, & Fitness",Consumer Services,Unknown / Non-Applicable,-1,-1
2,Data Science Manager,$111K-$181K (Glassdoor est.),Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,-1.0,Decode_M,"New York, NY","New York, NY",1 to 50 employees,-1,Unknown,-1,-1,Unknown / Non-Applicable,-1,TRUE
3,Data Analyst,$111K-$181K (Glassdoor est.),Sapphire Digital seeks a dynamic and driven mi...,3.4,Sapphire Digital\n3.4,"Lyndhurst, NJ","Lyndhurst, NJ",201 to 500 employees,2019,Company - Private,Internet,Information Technology,Unknown / Non-Applicable,"Zocdoc, Healthgrades",-1
4,"Director, Data Science",$111K-$181K (Glassdoor est.),"Director, Data Science - (200537)\nDescription...",3.4,United Entertainment Group\n3.4,"New York, NY","New York, NY",51 to 200 employees,2007,Company - Private,Advertising & Marketing,Business Services,Unknown / Non-Applicable,"BBDO, Grey Group, Droga5",-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4375,AWS Data Engineer,$55K-$112K (Glassdoor est.),About Us\n\nTachyon Technologies is a Digital ...,4.4,Tachyon Technologies\n4.4,"Dublin, OH","Irving, TX",201 to 500 employees,2011,Company - Private,IT Services,Information Technology,$10 to $25 million (USD),-1,-1
4376,Data Analyst â Junior,$55K-$112K (Glassdoor est.),"Job description\nInterpret data, analyze resul...",5.0,"Staffigo Technical Services, LLC\n5.0","Columbus, OH","Woodridge, IL",51 to 200 employees,2008,Company - Private,IT Services,Information Technology,$50 to $100 million (USD),-1,-1
4377,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),Job DescriptionThe Security Analytics Data Eng...,3.8,"PDS Tech, Inc.\n3.8","Dublin, OH","Irving, TX",5001 to 10000 employees,1977,Company - Private,Staffing & Outsourcing,Business Services,$100 to $500 million (USD),-1,-1
4378,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),The Security Analytics Data Engineer will inte...,4.0,Data Resource Technologies\n4.0,"Dublin, OH","Omaha, NE",1 to 50 employees,-1,Company - Private,Accounting,Accounting & Legal,Less than $1 million (USD),-1,-1
4379,Patient Safety Physician or Safety Scientist -...,$55K-$112K (Glassdoor est.),"Help us transform patients' lives.\nAt UCB, we...",3.7,UCB\n3.7,"Slough, OH","Brussel, Belgium",5001 to 10000 employees,-1,Company - Public,Biotech & Pharmaceuticals,Biotech & Pharmaceuticals,$2 to $5 billion (USD),AbbVie,-1

In [12]:
# Get cell info

In [13]:
df_data_scientist.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3909 entries, 0 to 4379
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Job Title          3909 non-null   object
 1   Salary Estimate    3909 non-null   object
 2   Job Description    3909 non-null   object
 3   Rating             3909 non-null   float64
 4   Company Name       3909 non-null   object
 5   Location           3909 non-null   object
 6   Headquarters       3909 non-null   object
 7   Size               3909 non-null   object
 8   Founded            3909 non-null   int64
 9   Type of ownership  3909 non-null   object
 10  Industry           3909 non-null   object
 11  Sector             3909 non-null   object
 12  Revenue            3909 non-null   object
 13  Competitors        3909 non-null   object
 14  Easy Apply         3909 non-null   object
dtypes: float64(1), int64(1), object(13)
memory usage: 488.6+ KB

In [14]:
df_data_scientist.shape

(3909, 15)

In [15]:
# Clean Salary Estimate.
# Remove range. Get average of maximum and minimum values and save it to
# another column 'Salary_Average_Clean'

In [87]:
df_data_scientist['Salary Estimate'].astype('str')

def salary_average(x):
    y = x.replace('(Glassdoor est.)', '').replace('(Employer est.)', '').replace('Per Hour(Glassdoor est.)', '').replace('Per Hour', '').replace('K', '000').replace('$', '').split('-')

    return (float(y[0]) + float(y[1])) / 2

In [88]:
df_data_scientist['Salary_Average_Clean'] = df_data_scientist['Salary Estimate'].apply(salary_average)

In [89]:
df_data_scientist[['Salary Estimate', 'Salary_Average_Clean']]

                    Salary Estimate  Salary_Average_Clean
index
0      $111K-$181K (Glassdoor est.)              146000.0
1      $111K-$181K (Glassdoor est.)              146000.0
2      $111K-$181K (Glassdoor est.)              146000.0
3      $111K-$181K (Glassdoor est.)              146000.0
4      $111K-$181K (Glassdoor est.)              146000.0
...                             ...                   ...
4375    $55K-$112K (Glassdoor est.)               83500.0
4376    $55K-$112K (Glassdoor est.)               83500.0
4377    $55K-$112K (Glassdoor est.)               83500.0
4378    $55K-$112K (Glassdoor est.)               83500.0
4379    $55K-$112K (Glassdoor est.)               83500.0

[3909 rows x 2 columns]

In [92]:
# Clean Job Description

In [94]:
df_data_scientist['Job Description'].astype('str')
def remove_n(x):
    y = x.replace('\n', ', ')
    return y

In [95]:
df_data_scientist['Job_Description_Clean'] = df_data_scientist['Job Description'].apply(remove_n)

In [96]:
df_data_scientist[['Job Description', 'Job_Description_Clean']]

,Job Description,Job_Description_Clean
index,,
0,"ABOUT HOPPER\n\nAt Hopper, we’re on a mission ...","ABOUT HOPPER, , At Hopper, we’re on a mission ..."
1,"At Noom, we use scientifically proven methods ...","At Noom, we use scientifically proven methods ..."
2,Decode_M\n\nhttps://www.decode-m.com/\n\nData ...,"Decode_M, , https://www.decode-m.com/, , Data ..."
3,Sapphire Digital seeks a dynamic and driven mi...,Sapphire Digital seeks a dynamic and driven mi...
4,"Director, Data Science - (200537)\nDescription...","Director, Data Science - (200537), Description..."
...,...,...
4375,About Us\n\nTachyon Technologies is a Digital ...,"About Us, , Tachyon Technologies is a Digital ..."
4376,"Job description\nInterpret data, analyze resul...","Job description, Interpret data, analyze resul..."
4377,Job DescriptionThe Security Analytics Data Eng...,Job DescriptionThe Security Analytics Data Eng...
4378,The Security Analytics Data Engineer will inte...,The Security Analytics Data Engineer will inte...
4379,"Help us transform patients' lives.\nAt UCB, we...","Help us transform patients' lives., At UCB, we..."

In [97]:
# Clean Rating

In [105]:
df_data_scientist['Rating'].astype('int')

index
0       3
1       4
2      -1
3       3
4       3
       ..
4375    4
4376    5
4377    3
4378    4
4379    3
Name: Rating, Length: 3909, dtype: int32

In [106]:
def negative_rating_cleanup(x):
    if x < 0:
        return None
    else:
        return x

In [107]:
df_data_scientist['Rating_Clean'] = df_data_scientist['Rating'].apply(negative_rating_cleanup)

In [108]:
df_data_scientist[['Rating', 'Rating_Clean']]

       Rating  Rating_Clean
index
0         3.5           3.5
1         4.5           4.5
2        -1.0           NaN
3         3.4           3.4
4         3.4           3.4
...       ...           ...
4375      4.4           4.4
4376      5.0           5.0
4377      3.8           3.8
4378      4.0           4.0
4379      3.7           3.7

[3909 rows x 2 columns]

In [109]:
# Clean Company Name

In [114]:
df_data_scientist['Company Name'].astype('str')
def remove_n_comp_name(x):
    y = x.split('\n')
    return y[0]

In [115]:
df_data_scientist['Company_Name_Clean'] = df_data_scientist['Company Name'].apply(remove_n_comp_name)

In [116]:
df_data_scientist[['Company Name', 'Company_Name_Clean']]

                                Company Name                Company_Name_Clean
index
0                                Hopper\n3.5                            Hopper
1                               Noom US\n4.5                           Noom US
2                                   Decode_M                          Decode_M
3                      Sapphire Digital\n3.4                  Sapphire Digital
4            United Entertainment Group\n3.4        United Entertainment Group
...                                      ...                               ...
4375               Tachyon Technologies\n4.4              Tachyon Technologies
4376   Staffigo Technical Services, LLC\n5.0  Staffigo Technical Services, LLC
4377                     PDS Tech, Inc.\n3.8                    PDS Tech, Inc.
4378         Data Resource Technologies\n4.0        Data Resource Technologies
4379                                UCB\n3.7                               UCB

[3909 rows x 2 columns]

In [117]:
# Clean Size. Make 2 additional columns for min and max number of employees

In [139]:
df_data_scientist['Size'].astype('str')

index
0         501 to 1000 employees
1        1001 to 5000 employees
2             1 to 50 employees
3          201 to 500 employees
4           51 to 200 employees
                 ...
4375       201 to 500 employees
4376        51 to 200 employees
4377    5001 to 10000 employees
4378          1 to 50 employees
4379    5001 to 10000 employees
Name: Size, Length: 3909, dtype: object

In [164]:
def get_num_group(x):
    y = x.replace('employees', '').split(' to ')
    return y

In [165]:
def get_min_num(x):
    y = get_num_group(x)
    return y[0]

In [196]:
def get_max_num(x):
    y = get_num_group(x)
    for i in range(1, len(y)):
        return y[i]

In [197]:
df_data_scientist['Minimum_No_Employees_Clean'] = df_data_scientist['Size'].apply(get_min_num)

In [198]:
df_data_scientist[['Size', 'Minimum_No_Employees_Clean']]

                          Size Minimum_No_Employees_Clean
index
0        501 to 1000 employees                        501
1       1001 to 5000 employees                       1001
2            1 to 50 employees                          1
3         201 to 500 employees                        201
4          51 to 200 employees                         51
...                        ...                        ...
4375      201 to 500 employees                        201
4376       51 to 200 employees                         51
4377   5001 to 10000 employees                       5001
4378         1 to 50 employees                          1
4379   5001 to 10000 employees                       5001

[3909 rows x 2 columns]

In [199]:
df_data_scientist['Maximum_No_Employees_Clean'] = df_data_scientist['Size'].apply(get_max_num)

In [200]:
df_data_scientist[['Size', 'Maximum_No_Employees_Clean']]

                          Size Maximum_No_Employees_Clean
index
0        501 to 1000 employees                      1000
1       1001 to 5000 employees                      5000
2            1 to 50 employees                        50
3         201 to 500 employees                       500
4          51 to 200 employees                       200
...                        ...                        ...
4375      201 to 500 employees                       500
4376       51 to 200 employees                       200
4377   5001 to 10000 employees                     10000
4378         1 to 50 employees                        50
4379   5001 to 10000 employees                     10000

[3909 rows x 2 columns]

In [201]:
# Clean Founded, Industry, Sector, Competitors by replacing -1 with 'Unknown'

In [202]:
df_data_scientist['Founded'].astype('str')

index
0       2007
1       2008
2         -1
3       2019
4       2007
        ...
4375    2011
4376    2008
4377    1977
4378      -1
4379      -1
Name: Founded, Length: 3909, dtype: object

In [203]:
df_data_scientist['Industry'].astype('str')

index
0                 Travel Agencies
1       Health, Beauty, & Fitness
2                              -1
3                        Internet
4         Advertising & Marketing
                  ...
4375                  IT Services
4376                  IT Services
4377       Staffing & Outsourcing
4378                   Accounting
4379    Biotech & Pharmaceuticals
Name: Industry, Length: 3909, dtype: object

In [204]:
df_data_scientist['Sector'].astype('str')

index
0                Travel & Tourism
1               Consumer Services
2                              -1
3          Information Technology
4               Business Services
                  ...
4375       Information Technology
4376       Information Technology
4377            Business Services
4378           Accounting & Legal
4379    Biotech & Pharmaceuticals
Name: Sector, Length: 3909, dtype: object

In [205]:
df_data_scientist['Competitors'].astype('str')

index
0                             -1
1                             -1
2                             -1
3           Zocdoc, Healthgrades
4       BBDO, Grey Group, Droga5
                  ...
4375                          -1
4376                          -1
4377                          -1
4378                          -1
4379                      AbbVie
Name: Competitors, Length: 3909, dtype: object

In [292]:
def replace_neg_one(x):
    if x != -1:
        return x
    else:
        return 'Unknown'

def replace_neg_one2(x):
    if x != '-1':
        return x
    else:
        return 'Unknown'

In [293]:
df_data_scientist['Founded_Clean'] = df_data_scientist['Founded'].apply(replace_neg_one)

In [294]:
df_data_scientist[['Founded', 'Founded_Clean']]

       Founded Founded_Clean
index
0         2007          2007
1         2008          2008
2           -1       Unknown
3         2019          2019
4         2007          2007
...        ...           ...
4375      2011          2011
4376      2008          2008
4377      1977          1977
4378        -1       Unknown
4379        -1       Unknown

[3909 rows x 2 columns]

In [295]:
df_data_scientist['Industry_Clean'] = df_data_scientist['Industry'].apply(replace_neg_one2)

In [296]:
df_data_scientist[['Industry', 'Industry_Clean']]

                        Industry             Industry_Clean
index
0                Travel Agencies            Travel Agencies
1      Health, Beauty, & Fitness  Health, Beauty, & Fitness
2                             -1                    Unknown
3                       Internet                   Internet
4        Advertising & Marketing    Advertising & Marketing
...                          ...                        ...
4375                 IT Services                IT Services
4376                 IT Services                IT Services
4377      Staffing & Outsourcing     Staffing & Outsourcing
4378                  Accounting                 Accounting
4379   Biotech & Pharmaceuticals  Biotech & Pharmaceuticals

[3909 rows x 2 columns]

In [297]:
df_data_scientist['Sector_Clean'] = df_data_scientist['Sector'].apply(replace_neg_one2)

In [298]:
df_data_scientist[['Sector', 'Sector_Clean']]

                          Sector               Sector_Clean
index
0               Travel & Tourism           Travel & Tourism
1              Consumer Services          Consumer Services
2                             -1                    Unknown
3         Information Technology     Information Technology
4              Business Services          Business Services
...                          ...                        ...
4375      Information Technology     Information Technology
4376      Information Technology     Information Technology
4377           Business Services          Business Services
4378          Accounting & Legal         Accounting & Legal
4379   Biotech & Pharmaceuticals  Biotech & Pharmaceuticals

[3909 rows x 2 columns]

In [299]:
df_data_scientist['Competitors_Clean'] = df_data_scientist['Competitors'].apply(replace_neg_one2)

In [300]:
df_data_scientist[['Competitors', 'Competitors_Clean']]

                    Competitors         Competitors_Clean
index
0                            -1                   Unknown
1                            -1                   Unknown
2                            -1                   Unknown
3          Zocdoc, Healthgrades      Zocdoc, Healthgrades
4      BBDO, Grey Group, Droga5  BBDO, Grey Group, Droga5
...                         ...                       ...
4375                         -1                   Unknown
4376                         -1                   Unknown
4377                         -1                   Unknown
4378                         -1                   Unknown
4379                     AbbVie                    AbbVie

[3909 rows x 2 columns]

In [301]:
# Clean Easy Apply. Replace -1 with False

In [307]:
df_data_scientist['Easy_Apply_Clean'] = df_data_scientist['Easy Apply'].apply(lambda x: x if x != '-1' else 'FALSE')

In [308]:
df_data_scientist[['Easy Apply', 'Easy_Apply_Clean']]

      Easy Apply Easy_Apply_Clean
index
0             -1            FALSE
1             -1            FALSE
2           TRUE             TRUE
3             -1            FALSE
4             -1            FALSE
...          ...              ...
4375          -1            FALSE
4376          -1            FALSE
4377          -1            FALSE
4378          -1            FALSE
4379          -1            FALSE

[3909 rows x 2 columns]